RANS_3D/channelFlow395K_EPSLS3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       175300;
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       176500;
    }
    sides1_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1000;
        startFace       177700;
        matchTolerance  0.0001;
        neighbourPatch  sides1_half1;
        transformType   translational;
        separation      (0 0 -2);
    }
    sides1_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1000;
        startFace       178700;
        matchTolerance  0.0001;
        neighbourPatch  sides1_half0;
        transformType   translational;
        separation      (0 0 2);
    }
    sides2_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1000;
        startFace       179700;
        matchTolerance  0.0001;
        neighbourPatch  sides2_half1;
        transformType   translational;
        separation      (0 0 -2);
    }
    sides2_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1000;
        startFace       180700;
        matchTolerance  0.0001;
        neighbourPatch  sides2_half0;
        transformType   translational;
        separation      (0 0 2);
    }
    inout1_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          750;
        startFace       181700;
        matchTolerance  0.0001;
        neighbourPatch  inout1_half1;
        transformType   translational;
        separation      (4 0 0);
    }
    inout1_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          750;
        startFace       182450;
        matchTolerance  0.0001;
        neighbourPatch  inout1_half0;
        transformType   translational;
        separation      (-4 0 0);
    }
    inout2_half0
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          750;
        startFace       183200;
        matchTolerance  0.0001;
        neighbourPatch  inout2_half1;
        transformType   translational;
        separation      (4 0 0);
    }
    inout2_half1
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          750;
        startFace       183950;
        matchTolerance  0.0001;
        neighbourPatch  inout2_half0;
        transformType   translational;
        separation      (-4 0 0);
    }
)

// ************************************************************************* //
