RANS_3D/channelFlow395K_EPSLS3D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;//steady
}

gradSchemes
{
    default         Gauss linear;
    //grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwindV grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear; 
    div(phi,k)      Gauss upwind;//bounded Gauss linear
    div(phi,epsilon) Gauss upwind;//bounded Gauss linear
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
   default         uncorrected;//corrected

}

fluxRequired
{
   default 	   no;
   p		   ;

}
wallDist
{
   method meshWave;
}

// ************************************************************************* //
