RANS_3D/channelFlow395K_EPSLS3D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    { 
	// solver        PCG;
	//solver		 smoothSolver;
        solver          GAMG;//PCG
	tolerance      1e-05;
	relTol         0.1;
	smoother	DICGaussSeidel;
	//smoother       GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
	}


    pFinal
    {
        $p;
	tolerance      1e-05;
	relTol         0;
	}

  
  

    "(U|k|epsilon)"
    {
    /*    solver          PBiCGStab; PBiCG
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0;
    */  
	// solver         PCG;
	solver          smoothSolver;
	smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
    "(U|k|epsilon)Final"
    {
	    $U
	    //solver         PCG;
	    //solver          smoothSolver;
	    //smoother        symGaussSeidel;
	    tolerance	1e-05;
	    relTol	0;
    }

}

PIMPLE//PISO if steady
{
    //momentumPredictor	 off;
    nOuterCorrectors     1;
    nCorrectors		 2;
    nNonOrthogonalCorrectors 0;
    pRefCell        1001;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p               1;
    }
    equations
    {
        U               1;//0.5
        k               1;//0.7
        epsilon         1;//0.7
    }
}

// ************************************************************************* //
