RANS_3D/channelFlow395K_EPSLS3D/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;

setFormat csv;

sets
(
    verticalline
    {
        type            lineCell;
        axis            y;
        start           (3.5 0 1);
        end             (3.5 2 1);
	//nPoints		30;
    }
);

fields
(
    U 
);


// ************************************************************************* //
